<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"local","plan_modifier":"e3630f9001b9936667c4e3e06530ade2c1fc9a214786147ee8133ccbea4f2d1c","backend":"f19d3f236904076c02b03b137ee4ade9818ff94fa7ecf0cd7c868468da0d7a2b","plan_job_ref":"Job Test actions using target, replace, and exclude #10 at https://github.com/dflook/terraform-github-actions/actions/runs/16656851314","plan_out_hash":"2b383cb5818dd7dda865141d95b25cd86e9162ae808c9c287fdd3378b02f12a0","plan_hash":"6882a2cac189106daac4da95f2ed766a5a568ff051683f969d91ae002af7cea5","plan_text_format":"diff","version":"99.0.0"} -->
Terraform plan in __tests/workflows/test-target-replace-exclude__
Targeting resources: `random_string.foreach["hello"]`
With variables: `length = 6`
<details>
<summary>Plan: 1 to add, 0 to change, 0 to destroy. Changes to Outputs.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create

Terraform will perform the following actions:

  # random_string.foreach["hello"] will be created
+   resource "random_string" "foreach" {
+       id          = (known after apply)
+       length      = 6
+       lower       = true
+       min_lower   = 0
+       min_numeric = 0
+       min_special = 0
+       min_upper   = 0
+       number      = true
+       numeric     = true
+       result      = (known after apply)
+       special     = false
+       upper       = true
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Changes to Outputs:
+   foreach = (known after apply)

Warning: Resource targeting is in effect

You are creating a plan with the -target option, which means that the result
of this plan may not represent all of the changes requested by the current
configuration.

The -target option is not for routine use, and is provided only for
exceptional situations such as recovering from errors or mistakes, or when
Terraform specifically suggests to use it as part of an error message.
```
</details>

:memo: Plan generated in [Test actions using target, replace, and exclude #10](https://github.com/dflook/terraform-github-actions/actions/runs/16656851314)